// Напиши скрипт управления формой логина.

// 1.Обработка отправки формы form.login-form должна быть по событию submit.
// 2.При отправке формы страница не должна перезагружаться.
// 3.Если в форме есть незаполненные поля, выводи alert с предупреждением о том,
//     что все поля должны быть заполнены.
// 4.Если пользователь заполнил все поля и отправил форму, собери значения полей в обьект,
//     где имя поля будет именем свойства, а значение поля - значением свойства.Для доступа 
//     к элементам формы используй свойство elements.
// 5.Выведи обьект с введенными данными в консоль и очисти значения полей формы методом reset.




// Створюємо посилання на елемент(форму) з HTML-файлу
const inputEmailEl = document.querySelector('.login-form');

// додаємо слухача на форму - де submit - подія для фоми,
// handleSubmit - колбек функція
inputEmailEl.addEventListener('submit', handleSubmit);

// об'являємо функцію handleSubmit
function handleSubmit(event) {
    // для того, щоб сторінка не перезавантажувалась при відправці форми
    //  знімаємо дефолтні значення event.preventDefault()
    event.preventDefault();
    // деструктурузиємо елементи форми інлайново і прирівнюємо до нашої форми
    const {elements: { email, password }} = event.currentTarget;

// ставимо умову: якщо значення в інпуті для email чи в інпуті для password  - 
    // це пуста строка, то виводимо alert
if (email.value === "" || password.value === "") {
   alert ("Необхідно заповнити всі поля!");
}
    // створюємо порожній об'єкт
    const data = {};
    // до об'єкту будемо додавати як ключі: email та password, зі значеннями
    //  email.value та password.value відповідно (тобто те, що введемо в інпути - 
    // і буде значеннями ключів)
    data.email = email.value;
    data.password = password.value;
    console.log(data);
// після того, як введемо коректні дані і відправимо їх, поля у формі очистяться - 
    // event.currentTarget.reset()
  event.currentTarget.reset();
}



